Show / Hide Table of Contents
Class ConcreteULSCheckResultFatigueEc2
ULS Check Fatigue Ec2
Inheritance
System.Object
ConcreteCheckResultBase
ConcreteULSCheckResultFatigue
ConcreteULSCheckResultFatigueEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ConcreteULSCheckResultFatigueEc2 : ConcreteULSCheckResultFatigue
Properties
Improve this Doc   View Source
DecissionMethod
decision fatigue check
Declaration
public FatigueMethod DecissionMethod { get; set; }
Property Value
 Type |  Description
 FatigueMethod
Improve this Doc   View Source
InternalForceMax
internal forces for fatigue calculation max
Declaration
public ResultOfInternalForces InternalForceMax { get; set; }
Property Value
 Type |  Description
 ResultOfInternalForces
Improve this Doc   View Source
InternalForceMin
internal forces for fatigue calculation min
Declaration
public ResultOfInternalForces InternalForceMin { get; set; }
Property Value
 Type |  Description
 ResultOfInternalForces
 Improve this Doc
 View Source